# Jonathan Hu, johu5262
# Hospital Database Project
## Video Link: https://www.youtube.com/watch?v=qCQa6F3dXQ4

In [1]:
import os
import configparser

mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("../mysql.cfg")    # YOUR CONFIG FILE HERE
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"
os.environ['DATABASE_URL'] = dburl  # define this env. var for sqlmagic

In [2]:
# Load the sql magic 
# Get the MySQL version number to verify we are connected
#
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.33',)]

# Table Creation

## Creating all the tables in the database

In [37]:
%%sql
CREATE TABLE Patients (
    PatientID INT PRIMARY KEY,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    DateOfBirth DATE,
    Gender CHAR(1)
);

CREATE TABLE Doctors (
      DoctorID INT PRIMARY KEY,
      FirstName VARCHAR(50),
      LastName VARCHAR(50),
      Specialization VARCHAR(100),
      DateOfBirth DATE,
      Gender CHAR(1)
);

CREATE TABLE Treatments (
    TreatmentID INT PRIMARY KEY,
    PatientID INT,
    DoctorID INT,
    TreatmentDate DATE,
    Cost DECIMAL(10, 2),
    FOREIGN KEY (PatientID) REFERENCES Patients(PatientID),
    FOREIGN KEY (DoctorID) REFERENCES Doctors(DoctorID)
);

CREATE TABLE Billing (
    BillID INT PRIMARY KEY,
    PatientID INT,
    TreatmentID INT,
    BillDate DATE,
    Amount DECIMAL(10, 2),
    FOREIGN KEY (PatientID) REFERENCES Patients(PatientID),
    FOREIGN KEY (TreatmentID) REFERENCES Treatments(TreatmentID)
);

CREATE TABLE Appointments (
    AppointmentID INT PRIMARY KEY,
    PatientID INT,
    DoctorID INT,
    AppointmentDate DATE,
    Description VARCHAR(255),
    FOREIGN KEY (PatientID) REFERENCES Patients(PatientID),
    FOREIGN KEY (DoctorID) REFERENCES Doctors(DoctorID)
);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

# Inserting Data Into Tables:

## -------------------------------------------------------------------------------------------------
## Patients Table

In [42]:
import csv
from sqlalchemy import create_engine, Column, Integer, String, Date
from sqlalchemy.orm import sessionmaker
from sqlalchemy.ext.declarative import declarative_base
from datetime import datetime
import os
import configparser

# Read MySQL credentials from the configuration file
mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("../mysql.cfg")  # Update the path to your configuration file
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"

os.environ['DATABASE_URL'] = dburl

# SQLAlchemy setup
Base = declarative_base()
engine = create_engine(dburl)
Session = sessionmaker(bind=engine)
session = Session()

# Define the Patients table
class Patients(Base):
    __tablename__ = 'Patients'
    PatientID = Column(Integer, primary_key=True)
    FirstName = Column(String(50))
    LastName = Column(String(50))
    DateOfBirth = Column(Date)
    Gender = Column(String(1))

# Create the Patients table
Base.metadata.create_all(engine)

# Read data from CSV and insert into the Patients table
csv_file = 'PatientID.csv'

with open(csv_file, 'r') as file:
    csv_reader = csv.reader(file)
    header = next(csv_reader)

    for row in csv_reader:
        patient_id = int(row[0])
        first_name = row[1]
        last_name = row[2]
        
        # Convert date from 'month/day/year' to 'year-month-day'
        date_of_birth = datetime.strptime(row[3], '%m/%d/%Y').date()
        
        gender = row[4]

        # Insert data into the Patients table
        new_patient = Patients(
            PatientID=patient_id,
            FirstName=first_name,
            LastName=last_name,
            DateOfBirth=date_of_birth,
            Gender=gender
        )
        session.add(new_patient)

session.commit()
session.close()

print(f'Data from {csv_file} successfully imported into the Patients table.')

Data from PatientID.csv successfully imported into the Patients table.

In [43]:
%%sql
SELECT * FROM Patients LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(1000000, '845', '1599', datetime.date(1958, 5, 2), 'M'),
 (1000001, '22', '1377', datetime.date(1981, 2, 25), 'M'),
 (1000002, '921', '1854', datetime.date(2007, 3, 1), 'M'),
 (1000003, '138', '1419', datetime.date(1989, 5, 24), 'F'),
 (1000004, '781', '1989', datetime.date(1982, 2, 5), 'F')]

## -------------------------------------------------------------------------------------------------
## Doctor Table

In [ ]:
import csv
from sqlalchemy import create_engine, Column, Integer, String, Date
from sqlalchemy.orm import sessionmaker
from sqlalchemy.ext.declarative import declarative_base
from datetime import datetime
import os
import configparser

# Read MySQL credentials from the configuration file
mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("../mysql.cfg")  # Update the path to your configuration file
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"

# Set the DATABASE_URL environment variable for SQLMagic
os.environ['DATABASE_URL'] = dburl

# SQLAlchemy setup
Base = declarative_base()
engine = create_engine(dburl)
Session = sessionmaker(bind=engine)
session = Session()

# Define the Doctors table
class Doctors(Base):
    __tablename__ = 'Doctors'
    DoctorID = Column(Integer, primary_key=True)
    FirstName = Column(String(50))
    LastName = Column(String(50))
    Specialization = Column(String(100))
    DateOfBirth = Column(Date)
    Gender = Column(String(1))

# Create the Doctors table if it doesn't exist
Base.metadata.create_all(engine)

# Read data from CSV and insert into the Doctors table
csv_file = 'DoctorID.csv'

with open(csv_file, 'r') as file:
    csv_reader = csv.reader(file)
    header = next(csv_reader)

    for row in csv_reader:
        doctor_id = int(row[0])
        first_name = row[1]
        last_name = row[2]
        specialization = row[3]
        date_of_birth = datetime.strptime(row[4], '%m/%d/%Y').date()
        gender = row[5]

        # Insert data into the Doctors table
        new_doctor = Doctors(
            DoctorID=doctor_id,
            FirstName=first_name,
            LastName=last_name,
            Specialization=specialization,
            DateOfBirth=date_of_birth,
            Gender=gender
        )
        session.add(new_doctor)
session.commit()
session.close()

print(f'Data from {csv_file} successfully imported into the Doctors table.')

In [6]:
%%sql
SELECT * FROM Doctors LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(2000000, '697', '1840', 'Oncology', datetime.date(1988, 2, 19), 'M'),
 (2000001, '413', '1913', 'Geriatric Medicine', datetime.date(1990, 2, 13), 'F'),
 (2000002, '685', '1452', 'Pediatrics', datetime.date(1971, 12, 1), 'M'),
 (2000003, '515', '1858', 'Psychiatry', datetime.date(1967, 12, 26), 'F'),
 (2000004, '867', '1278', 'Geriatric Medicine', datetime.date(1984, 11, 21), 'M')]

## -------------------------------------------------------------------------------------------------
## Treatment Table

In [5]:
import csv
from sqlalchemy import create_engine, Column, Integer, Date, Numeric, ForeignKey, String
from sqlalchemy.orm import sessionmaker, relationship
from sqlalchemy.ext.declarative import declarative_base
from datetime import datetime
import os
import configparser

# Read MySQL credentials from the configuration file
mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("../mysql.cfg")  # Update the path to your configuration file
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"

os.environ['DATABASE_URL'] = dburl

# SQLAlchemy setup
Base = declarative_base()
engine = create_engine(dburl)
Session = sessionmaker(bind=engine)
session = Session()

# Define the Doctors table
class Doctors(Base):
    __tablename__ = 'Doctors'
    DoctorID = Column(Integer, primary_key=True)
    FirstName = Column(String(50))
    LastName = Column(String(50))
    Specialization = Column(String(100))
    DateOfBirth = Column(Date)
    Gender = Column(String(1))
    treatments = relationship('Treatments', back_populates='doctor')

# Define the Treatments table
class Treatments(Base):
    __tablename__ = 'Treatments'
    TreatmentID = Column(Integer, primary_key=True)
    PatientID = Column(Integer, ForeignKey('Patients.PatientID'))
    DoctorID = Column(Integer, ForeignKey('Doctors.DoctorID'))
    TreatmentDate = Column(Date)
    Cost = Column(Numeric(10, 2))
    doctor = relationship('Doctors', back_populates='treatments')
    patient = relationship('Patients', back_populates='treatments')

# Define the Patients table
class Patients(Base):
    __tablename__ = 'Patients'
    PatientID = Column(Integer, primary_key=True)
    FirstName = Column(String(50))
    LastName = Column(String(50))
    DateOfBirth = Column(Date)
    Gender = Column(String(1))
    treatments = relationship('Treatments', back_populates='patient')

# Create the Treatments table if it doesn't exist
Base.metadata.create_all(engine)

# Read data from CSV and insert into the Treatments table
csv_file = 'Treatment.csv'

with open(csv_file, 'r') as file:
    csv_reader = csv.reader(file)
    header = next(csv_reader)

    for row in csv_reader:
        treatment_id = int(row[0])
        patient_id = int(row[1])
        doctor_id = int(row[2]) if row[2] else None  # Handle null value for DoctorID
        treatment_date = datetime.strptime(row[3], '%m/%d/%Y').date()
        cost = float(row[4]) if row[4] else None  # Handle null value for Cost

        # Insert data into the Treatments table
        new_treatment = Treatments(
            TreatmentID=treatment_id,
            PatientID=patient_id,
            DoctorID=doctor_id,
            TreatmentDate=treatment_date,
            Cost=cost
        )
        session.add(new_treatment)
session.commit()
session.close()

print(f'Data from {csv_file} successfully imported into the Treatments table.')

Data from Treatment.csv successfully imported into the Treatments table.

In [6]:
%%sql
SELECT * FROM Treatments LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(1000, 1000182, 2000255, datetime.date(2022, 4, 23), Decimal('2113.62')),
 (1001, 1000237, 2000122, datetime.date(2020, 7, 30), Decimal('291.38')),
 (1002, 1000714, 2000147, datetime.date(2023, 4, 24), Decimal('274.17')),
 (1003, 1000371, 2000166, datetime.date(2020, 9, 13), Decimal('2565.47')),
 (1004, 1000024, 2000280, datetime.date(2023, 8, 17), Decimal('1251.05'))]

## -------------------------------------------------------------------------------------------------
## Billing Table

In [9]:
import csv
from sqlalchemy import create_engine, Column, Integer, Date, ForeignKey, Numeric
from sqlalchemy.orm import sessionmaker, relationship
from sqlalchemy.ext.declarative import declarative_base
from datetime import datetime
import os
import configparser

# Read MySQL credentials from the configuration file
mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("../mysql.cfg")  # Update the path to your configuration file
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"

# Set the DATABASE_URL environment variable for SQLMagic
os.environ['DATABASE_URL'] = dburl

# SQLAlchemy setup
Base = declarative_base()
engine = create_engine(dburl)
Session = sessionmaker(bind=engine)
session = Session()

# Define the Patients table
class Patients(Base):
    __tablename__ = 'Patients'
    PatientID = Column(Integer, primary_key=True)
    FirstName = Column(String(50))
    LastName = Column(String(50))
    DateOfBirth = Column(Date)
    Gender = Column(String(1))
    billing = relationship('Billing', back_populates='patient')

# Create the Patients table if it doesn't exist
Base.metadata.create_all(engine)

# Define the Treatments table
class Treatments(Base):
    __tablename__ = 'Treatments'
    TreatmentID = Column(Integer, primary_key=True)
    PatientID = Column(Integer, ForeignKey('Patients.PatientID'))
    DoctorID = Column(Integer, ForeignKey('Doctors.DoctorID'))
    TreatmentDate = Column(Date)
    Cost = Column(Numeric(10, 2))
    billing = relationship('Billing', back_populates='treatment')

# Create the Treatments table if it doesn't exist
Base.metadata.create_all(engine)

# Define the Billing table
class Billing(Base):
    __tablename__ = 'Billing'
    BillID = Column(Integer, primary_key=True)
    PatientID = Column(Integer, ForeignKey('Patients.PatientID'))
    TreatmentID = Column(Integer, ForeignKey('Treatments.TreatmentID'))
    BillDate = Column(Date)
    Amount = Column(Numeric(10, 2))
    patient = relationship('Patients', back_populates='billing')
    treatment = relationship('Treatments', back_populates='billing')

# Create the Billing table if it doesn't exist
Base.metadata.create_all(engine)

# Read data from CSV and insert into the Billing table
csv_file = 'Billing.csv'

with open(csv_file, 'r') as file:
    csv_reader = csv.reader(file)
    header = next(csv_reader)

    for row in csv_reader:
        bill_id = int(row[0])
        patient_id = int(row[1])
        treatment_id = int(row[2])
        bill_date = datetime.strptime(row[3], '%m/%d/%Y').date()
        amount = float(row[4])

        # Insert data into the Billing table
        new_billing = Billing(
            BillID=bill_id,
            PatientID=patient_id,
            TreatmentID=treatment_id,
            BillDate=bill_date,
            Amount=amount
        )
        session.add(new_billing)
session.commit()
session.close()

print(f'Data from {csv_file} successfully imported into the Billing table.')

Data from Billing.csv successfully imported into the Billing table.

In [10]:
%%sql
SELECT * FROM Billing LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(700000, 1000182, 1000, datetime.date(2022, 10, 23), Decimal('2113.62')),
 (700001, 1000237, 1001, datetime.date(2021, 1, 30), Decimal('291.38')),
 (700002, 1000714, 1002, datetime.date(2023, 10, 24), Decimal('274.17')),
 (700003, 1000371, 1003, datetime.date(2021, 3, 13), Decimal('2565.47')),
 (700004, 1000024, 1004, datetime.date(2024, 2, 17), Decimal('1251.05'))]

## Appointment table

In [33]:
import csv
from sqlalchemy import create_engine, Column, Integer, Date, Numeric, ForeignKey, String
from sqlalchemy.orm import sessionmaker, relationship
from sqlalchemy.ext.declarative import declarative_base
from datetime import datetime
import os
import configparser

# Read MySQL credentials from the configuration file
mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("../mysql.cfg")  # Update the path to your configuration file
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"

os.environ['DATABASE_URL'] = dburl

# SQLAlchemy setup
Base = declarative_base()
engine = create_engine(dburl)
Session = sessionmaker(bind=engine)
session = Session()

# Define the Doctors table
class Doctors(Base):
    __tablename__ = 'Doctors'
    DoctorID = Column(Integer, primary_key=True)
    FirstName = Column(String(50))
    LastName = Column(String(50))
    Specialization = Column(String(100))
    DateOfBirth = Column(Date)
    Gender = Column(String(1))
    appointments = relationship('Appointments', back_populates='doctor')

# Define the Patients table
class Patients(Base):
    __tablename__ = 'Patients'
    PatientID = Column(Integer, primary_key=True)
    FirstName = Column(String(50))
    LastName = Column(String(50))
    DateOfBirth = Column(Date)
    Gender = Column(String(1))
    appointments = relationship('Appointments', back_populates='patient')

# Define the Appointments table
class Appointments(Base):
    __tablename__ = 'Appointments'
    AppointmentID = Column(Integer, primary_key=True)
    PatientID = Column(Integer, ForeignKey('Patients.PatientID'))
    DoctorID = Column(Integer, ForeignKey('Doctors.DoctorID'))
    AppointmentDate = Column(Date)
    Description = Column(String)  # Assuming Description is a string
    patient = relationship('Patients', back_populates='appointments')
    doctor = relationship('Doctors', back_populates='appointments')

# Create the Appointments table if it doesn't exist
Base.metadata.create_all(engine)

# Read data from CSV and insert into the Appointments table
csv_file = 'Appointment.csv'

with open(csv_file, 'r') as file:
    csv_reader = csv.reader(file)
    header = next(csv_reader)

    for row in csv_reader:
        appointment_id = int(row[0])
        patient_id = int(row[1])
        doctor_id = int(row[2]) if row[2] else None  # Handle null value for DoctorID
        appointment_date = datetime.strptime(row[3], '%m/%d/%Y').date()
        description = row[4]  # Assuming Description is the 5th column

        # Insert data into the Appointments table
        new_appointment = Appointments(
            AppointmentID=appointment_id,
            PatientID=patient_id,
            DoctorID=doctor_id,
            AppointmentDate=appointment_date,
            Description=description
        )
        session.add(new_appointment)

session.commit()
session.close()

print(f'Data from {csv_file} successfully imported into the Appointments table.')

Data from Appointment.csv successfully imported into the Appointments table.

In [34]:
%%sql
SELECT * FROM Appointments LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(500000, 1000182, 2000255, datetime.date(2022, 1, 23), 'Routine Vaccination'),
 (500001, 1000237, 2000122, datetime.date(2020, 4, 30), 'Chronic Disease Management'),
 (500002, 1000714, 2000147, datetime.date(2023, 1, 24), 'Diagnostic Imaging'),
 (500003, 1000371, 2000166, datetime.date(2020, 6, 13), 'Chronic Disease Management'),
 (500004, 1000024, 2000280, datetime.date(2023, 5, 17), 'Alternative Medicine Consultation')]

## -------------------------------------------------------------------------------------------------
# Table Joins

## Retrieve a list of all treatments with details about the associated patient and doctor:

In [79]:
%%sql
SELECT Treatments.TreatmentID, Treatments.TreatmentDate, Treatments.Cost,
       Patients.FirstName AS PatientFirstName, Patients.LastName AS PatientLastName,
       Doctors.FirstName AS DoctorFirstName, Doctors.LastName AS DoctorLastName
FROM Treatments
JOIN Patients ON Treatments.PatientID = Patients.PatientID
JOIN Doctors ON Treatments.DoctorID = Doctors.DoctorID
LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(1000, datetime.date(2022, 4, 23), Decimal('2113.62'), '692', '1020', '525', '1619'),
 (1001, datetime.date(2020, 7, 30), Decimal('291.38'), '964', '1373', '455', '1578'),
 (1002, datetime.date(2023, 4, 24), Decimal('274.17'), '119', '1001', '177', '1019'),
 (1003, datetime.date(2020, 9, 13), Decimal('2565.47'), '253', '1130', '373', '1707'),
 (1004, datetime.date(2023, 8, 17), Decimal('1251.05'), '377', '1463', '243', '1761')]

## Patients greater than or equal to 5 different treatments

In [119]:
%%sql
SELECT Patients.PatientID, Patients.FirstName, Patients.LastName, COUNT(Treatments.TreatmentID) AS TreatmentCount
FROM Patients
JOIN Treatments ON Patients.PatientID = Treatments.PatientID
GROUP BY Patients.PatientID, Patients.FirstName, Patients.LastName
HAVING COUNT(Treatments.TreatmentID) >= 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(1000457, '565', '1193', 6),
 (1000485, '912', '1045', 5),
 (1000490, '21', '1534', 5),
 (1000560, '424', '1459', 5),
 (1000986, '551', '1354', 7)]

## All the information regarding patient with PatientID 1000118

In [120]:
%%sql
SELECT Patients.PatientID, Patients.FirstName, Patients.LastName, Patients.DateOfBirth, Patients.Gender,
       Treatments.TreatmentID, Treatments.TreatmentDate,
       Billing.BillID, Billing.BillDate, Billing.Amount,
       Appointments.AppointmentID, Appointments.AppointmentDate, Appointments.Description,
       Doctors.DoctorID, Doctors.FirstName AS DoctorFirstName, Doctors.LastName AS DoctorLastName, Doctors.Specialization
FROM Patients
LEFT JOIN Treatments ON Patients.PatientID = Treatments.PatientID
LEFT JOIN Billing ON Patients.PatientID = Billing.PatientID
LEFT JOIN Appointments ON Patients.PatientID = Appointments.PatientID
LEFT JOIN Doctors ON Treatments.DoctorID = Doctors.DoctorID OR Appointments.DoctorID = Doctors.DoctorID
WHERE Patients.PatientID = 1000118
LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
1 rows affected.

[(1000318, '273', '1302', datetime.date(1981, 1, 4), 'M', 1062, datetime.date(2021, 6, 3), 700062, datetime.date(2021, 12, 3), Decimal('1063.18'), 500062, datetime.date(2021, 3, 3), 'Illness', 2000040, '794', '1750', 'Radiology')]

## Highest total cost of treatments and the number of treatments per patient

In [55]:
%%sql
SELECT Patients.PatientID, Patients.FirstName, Patients.LastName,
       COUNT(Treatments.TreatmentID) AS TotalTreatmentCount,
       SUM(Treatments.Cost) AS TotalTreatmentCost
FROM Patients
LEFT JOIN Treatments ON Patients.PatientID = Treatments.PatientID
GROUP BY Patients.PatientID, Patients.FirstName, Patients.LastName
ORDER BY TotalTreatmentCost DESC
LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(1000986, '551', '1354', 7, Decimal('20088.48')),
 (1000615, '493', '1809', 4, Decimal('16438.66')),
 (1000457, '565', '1193', 6, Decimal('15598.40')),
 (1000560, '424', '1459', 5, Decimal('15084.15')),
 (1000904, '644', '1222', 4, Decimal('14727.37'))]

## --------------------------------------------------------------------------------------
# Indexes

### This index adds the AppointmentDate column in the Appointments table.

In [101]:
%%sql
CREATE INDEX idx_AppointmentDate ON Appointments (AppointmentDate);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.

[]

### Here we can use this index to retrieve appointments that occurred on or after a certain date:

In [103]:
%%sql
SELECT *
FROM Appointments
WHERE AppointmentDate >= '2023-01-01'
LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(500387, 1000289, 2000194, datetime.date(2023, 1, 1), 'Alternative Medicine Consultation'),
 (500208, 1000592, 2000387, datetime.date(2023, 1, 2), 'Immunodecificiency Evaluation'),
 (500472, 1000947, 2000285, datetime.date(2023, 1, 4), 'Rehabilitation Service'),
 (500612, 1000771, 2000377, datetime.date(2023, 1, 6), 'Diagnostics Testing'),
 (500942, 1000668, 2000093, datetime.date(2023, 1, 6), 'Specialist Referall')]

### This index can be utilized by queries that involve sorting DoctorID's for doctors specializing in Anesthesiology.

In [106]:
%%sql
CREATE INDEX idx_Anesthesiology_DoctorID ON Doctors (Specialization, DoctorID);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.

[]

In [108]:
%%sql
SELECT *
FROM Doctors
WHERE Specialization = 'Anesthesiology'
ORDER BY DoctorID
LIMIT 5;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(2000031, '661', '1090', 'Anesthesiology', datetime.date(1974, 7, 23), 'F'),
 (2000044, '462', '1754', 'Anesthesiology', datetime.date(1997, 1, 29), 'F'),
 (2000053, '59', '1063', 'Anesthesiology', datetime.date(1977, 7, 24), 'M'),
 (2000078, '357', '1938', 'Anesthesiology', datetime.date(1981, 3, 17), 'M'),
 (2000083, '270', '1023', 'Anesthesiology', datetime.date(1974, 11, 5), 'F')]

## -------------------------------------------------------------------------
# Triggers

## Trigger that prevents a patient from having multiple treatments within a single day

In [60]:
%%sql
CREATE TRIGGER before_treatment_insert
BEFORE INSERT ON Treatments
FOR EACH ROW
BEGIN
    DECLARE treatment_count INT;

    -- Check if the patient already has a treatment on the same day
    SELECT COUNT(*)
    INTO treatment_count
    FROM Treatments
    WHERE PatientID = NEW.PatientID
      AND TreatmentDate = NEW.TreatmentDate;

    -- If there's already a treatment, prevent the new insertion
    IF treatment_count > 0 THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Patients cannot have two treatments on the same day';
    END IF;
END;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.

[]

### Attempt to insert another treatment on the same day

In [121]:
%%sql
INSERT INTO Treatments (PatientID, DoctorID, TreatmentDate, Cost)
VALUES (1000485, 2000344, '2020-10-16', 150.00);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
(MySQLdb.OperationalError) (1644, 'Patients cannot have two treatments on the same day')
[SQL: INSERT INTO Treatments (PatientID, DoctorID, TreatmentDate, Cost)
VALUES (1000485, 2000344, '2020-10-16', 150.00);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Trigger that prevents a doctor from being able to book more than 5 appointments in a single day

In [63]:
%%sql
CREATE TRIGGER before_appointment_insert
BEFORE INSERT ON Appointments
FOR EACH ROW
BEGIN
    DECLARE appointment_count INT;

    -- Check if the doctor already has 5 appointments on the same day
    SELECT COUNT(*)
    INTO appointment_count
    FROM Appointments
    WHERE DoctorID = NEW.DoctorID
      AND AppointmentDate = NEW.AppointmentDate;

    -- If there are already 5 appointments, prevent the new insertion
    IF appointment_count >= 5 THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Doctors cannot have more than 5 appointments in a single day';
    END IF;
END;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.

[]

### Insert 5 appointments on the same day for DoctorID 2000344

In [67]:
%%sql
INSERT INTO Appointments (AppointmentID, PatientID, DoctorID, AppointmentDate, Description)
VALUES
    (510000,1000485, 2000344, '2022-01-01', 'Appointment 1'),
    (510001,1000486, 2000344, '2022-01-01', 'Appointment 2'),
    (510002,1000487, 2000344, '2022-01-01', 'Appointment 3'),
    (510003,1000488, 2000344, '2022-01-01', 'Appointment 4'),
    (510004,1000489, 2000344, '2022-01-01', 'Appointment 5');

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[]

### Table After Insertion

In [71]:
%%sql
SELECT *
FROM Appointments
WHERE (AppointmentID, PatientID, DoctorID, AppointmentDate, Description)
IN ((510000, 1000485, 2000344, '2022-01-01', 'Appointment 1'),
    (510001, 1000486, 2000344, '2022-01-01', 'Appointment 2'),
    (510002, 1000487, 2000344, '2022-01-01', 'Appointment 3'),
    (510003, 1000488, 2000344, '2022-01-01', 'Appointment 4'),
    (510004, 1000489, 2000344, '2022-01-01', 'Appointment 5'));

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
5 rows affected.

[(510000, 1000485, 2000344, datetime.date(2022, 1, 1), 'Appointment 1'),
 (510001, 1000486, 2000344, datetime.date(2022, 1, 1), 'Appointment 2'),
 (510002, 1000487, 2000344, datetime.date(2022, 1, 1), 'Appointment 3'),
 (510003, 1000488, 2000344, datetime.date(2022, 1, 1), 'Appointment 4'),
 (510004, 1000489, 2000344, datetime.date(2022, 1, 1), 'Appointment 5')]

### Attempting to insert the 6th appointment for DoctorID 2000344
### This should activate the trigger

In [122]:
%%sql
INSERT INTO Appointments (AppointmentID,PatientID, DoctorID, AppointmentDate, Description)
VALUES
    (510005,1000490, 2000344, '2022-01-01', 'Appointment 6');

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
(MySQLdb.OperationalError) (1644, 'Doctors cannot have more than 5 appointments in a single day')
[SQL: INSERT INTO Appointments (AppointmentID,PatientID, DoctorID, AppointmentDate, Description)
VALUES
    (510005,1000490, 2000344, '2022-01-01', 'Appointment 6');]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### This Trigger will prevent the deletion of a patient if there are corresponding records in the Treatments or Appointments tables:

In [75]:
%%sql
CREATE TRIGGER before_patient_delete
BEFORE DELETE ON Patients
FOR EACH ROW
BEGIN
    DECLARE treatment_count INT;
    DECLARE appointment_count INT;

    -- Check if the patient has treatments
    SELECT COUNT(*) INTO treatment_count
    FROM Treatments
    WHERE PatientID = OLD.PatientID;

    -- Check if the patient has appointments
    SELECT COUNT(*) INTO appointment_count
    FROM Appointments
    WHERE PatientID = OLD.PatientID;

    -- If there are treatments or appointments, prevent the deletion
    IF treatment_count > 0 OR appointment_count > 0 THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Cannot delete patient with associated treatments or appointments';
    END IF;
END

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.

[]

### Sample Patients w/ Sample Treatments and Appointments

In [93]:
%%sql
INSERT INTO Patients VALUES (9999999, 'John', 'Doe', '1990-01-01', 'M');
INSERT INTO Patients VALUES (9999998, 'Jane', 'Smith', '1985-05-15', 'F');

INSERT INTO Treatments VALUES (1, 9999999,2000094, '2022-01-15', 150.00);
INSERT INTO Appointments VALUES (1, 9999998,2000129, '2022-02-20', 'Checkup');

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [96]:
%%sql
SELECT
    p.PatientID,
    p.FirstName,
    p.LastName,
    t.TreatmentID,
    t.DoctorID,
    t.TreatmentDate,
    t.Cost
FROM Patients p
JOIN Treatments t ON p.PatientID = t.PatientID
WHERE p.PatientID = 9999999;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
1 rows affected.

[(9999999, 'John', 'Doe', 1, 2000094, datetime.date(2022, 1, 15), Decimal('150.00'))]

In [98]:
%%sql
SELECT
    p.PatientID,
    p.FirstName,
    p.LastName,
    a.AppointmentID,
    a.DoctorID,
    a.AppointmentDate,
    a.Description
FROM Patients p
JOIN Appointments a ON p.PatientID = a.PatientID
WHERE p.PatientID = 9999998;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
1 rows affected.

[(9999998, 'Jane', 'Smith', 1, 2000129, datetime.date(2022, 2, 20), 'Checkup')]

In [123]:
%%sql
DELETE FROM Patients WHERE PatientID = 9999999;
DELETE FROM Patients WHERE PatientID = 9999998;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
(MySQLdb.OperationalError) (1644, 'Cannot delete patient with associated treatments or appointments')
[SQL: DELETE FROM Patients WHERE PatientID = 9999999;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)